zephyrproject-rtos/hal_gigadevice/include/dt-bindings/pinctrl/gd32f407z(e-g-k)xx-pinctrl.h
/* CK_OUT0 */
#define CK_OUT0_PA8 \
	GD32_PINMUX_AF('A', 8, AF0)

/* CK_OUT1 */
#define CK_OUT1_PC9 \
	GD32_PINMUX_AF('C', 9, AF0)

/* CTC_SYNC */
#define CTC_SYNC_PA8 \
	GD32_PINMUX_AF('A', 8, AF9)
#define CTC_SYNC_PD15 \
	GD32_PINMUX_AF('D', 15, AF0)
#define CTC_SYNC_PF0 \
	GD32_PINMUX_AF('F', 0, AF0)

/* DAC_OUT0 */
#define DAC_OUT0_PA4 \
	GD32_PINMUX_AF('A', 4, ANALOG)

/* DAC_OUT1 */
#define DAC_OUT1_PA5 \
	GD32_PINMUX_AF('A', 5, ANALOG)

/* DCI_D0 */
#define DCI_D0_PA9 \
	GD32_PINMUX_AF('A', 9, AF13)
#define DCI_D0_PC6 \
	GD32_PINMUX_AF('C', 6, AF13)

/* DCI_D1 */
#define DCI_D1_PA10 \
	GD32_PINMUX_AF('A', 10, AF13)
#define DCI_D1_PC7 \
	GD32_PINMUX_AF('C', 7, AF13)

/* DCI_D10 */
#define DCI_D10_PB5 \
	GD32_PINMUX_AF('B', 5, AF13)
#define DCI_D10_PD6 \
	GD32_PINMUX_AF('D', 6, AF13)

/* DCI_D11 */
#define DCI_D11_PD2 \
	GD32_PINMUX_AF('D', 2, AF13)
#define DCI_D11_PF10 \
	GD32_PINMUX_AF('F', 10, AF13)

/* DCI_D12 */
#define DCI_D12_PF11 \
	GD32_PINMUX_AF('F', 11, AF13)
#define DCI_D12_PG6 \
	GD32_PINMUX_AF('G', 6, AF13)

/* DCI_D13 */
#define DCI_D13_PG7 \
	GD32_PINMUX_AF('G', 7, AF13)
#define DCI_D13_PG15 \
	GD32_PINMUX_AF('G', 15, AF13)

/* DCI_D2 */
#define DCI_D2_PC8 \
	GD32_PINMUX_AF('C', 8, AF13)
#define DCI_D2_PE0 \
	GD32_PINMUX_AF('E', 0, AF13)
#define DCI_D2_PG10 \
	GD32_PINMUX_AF('G', 10, AF13)

/* DCI_D3 */
#define DCI_D3_PC9 \
	GD32_PINMUX_AF('C', 9, AF13)
#define DCI_D3_PE1 \
	GD32_PINMUX_AF('E', 1, AF13)
#define DCI_D3_PG11 \
	GD32_PINMUX_AF('G', 11, AF13)

/* DCI_D4 */
#define DCI_D4_PC11 \
	GD32_PINMUX_AF('C', 11, AF13)
#define DCI_D4_PE4 \
	GD32_PINMUX_AF('E', 4, AF13)

/* DCI_D5 */
#define DCI_D5_PB6 \
	GD32_PINMUX_AF('B', 6, AF13)
#define DCI_D5_PD3 \
	GD32_PINMUX_AF('D', 3, AF13)

/* DCI_D6 */
#define DCI_D6_PB8 \
	GD32_PINMUX_AF('B', 8, AF13)
#define DCI_D6_PE5 \
	GD32_PINMUX_AF('E', 5, AF13)

/* DCI_D7 */
#define DCI_D7_PB9 \
	GD32_PINMUX_AF('B', 9, AF13)
#define DCI_D7_PE6 \
	GD32_PINMUX_AF('E', 6, AF13)

/* DCI_D8 */
#define DCI_D8_PC10 \
	GD32_PINMUX_AF('C', 10, AF13)

/* DCI_D9 */
#define DCI_D9_PC12 \
	GD32_PINMUX_AF('C', 12, AF13)

/* DCI_HSYNC */
#define DCI_HSYNC_PA4 \
	GD32_PINMUX_AF('A', 4, AF13)

/* DCI_PIXCLK */
#define DCI_PIXCLK_PA6 \
	GD32_PINMUX_AF('A', 6, AF13)

/* DCI_VSYNC */
#define DCI_VSYNC_PB7 \
	GD32_PINMUX_AF('B', 7, AF13)
#define DCI_VSYNC_PG9 \
	GD32_PINMUX_AF('G', 9, AF13)

/* ENET_MDC */
#define ENET_MDC_PC1 \
	GD32_PINMUX_AF('C', 1, AF11)

/* ENET_MDIO */
#define ENET_MDIO_PA2 \
	GD32_PINMUX_AF('A', 2, AF11)

/* ENET_MII_COL */
#define ENET_MII_COL_PA3 \
	GD32_PINMUX_AF('A', 3, AF11)

/* ENET_MII_CRS */
#define ENET_MII_CRS_PA0 \
	GD32_PINMUX_AF('A', 0, AF11)

/* ENET_MII_RXD0 */
#define ENET_MII_RXD0_PC4 \
	GD32_PINMUX_AF('C', 4, AF11)

/* ENET_MII_RXD1 */
#define ENET_MII_RXD1_PC5 \
	GD32_PINMUX_AF('C', 5, AF11)

/* ENET_MII_RXD2 */
#define ENET_MII_RXD2_PB0 \
	GD32_PINMUX_AF('B', 0, AF11)

/* ENET_MII_RXD3 */
#define ENET_MII_RXD3_PB1 \
	GD32_PINMUX_AF('B', 1, AF11)

/* ENET_MII_RX_CLK */
#define ENET_MII_RX_CLK_PA1 \
	GD32_PINMUX_AF('A', 1, AF11)

/* ENET_MII_RX_DV */
#define ENET_MII_RX_DV_PA7 \
	GD32_PINMUX_AF('A', 7, AF11)

/* ENET_MII_RX_ER */
#define ENET_MII_RX_ER_PB9 \
	GD32_PINMUX_AF('B', 9, AF1)

/* ENET_MII_TXD0 */
#define ENET_MII_TXD0_PB11 \
	GD32_PINMUX_AF('B', 11, AF11)

/* ENET_MII_TXD1 */
#define ENET_MII_TXD1_PB12 \
	GD32_PINMUX_AF('B', 12, AF11)

/* ENET_MII_TXD2 */
#define ENET_MII_TXD2_PC2 \
	GD32_PINMUX_AF('C', 2, AF11)

/* ENET_MII_TXD3 */
#define ENET_MII_TXD3_PB8 \
	GD32_PINMUX_AF('B', 8, AF11)
#define ENET_MII_TXD3_PE2 \
	GD32_PINMUX_AF('E', 2, AF11)

/* ENET_MII_TX_CLK */
#define ENET_MII_TX_CLK_PC3 \
	GD32_PINMUX_AF('C', 3, AF11)

/* ENET_MII_TX_EN */
#define ENET_MII_TX_EN_PB10 \
	GD32_PINMUX_AF('B', 10, AF11)

/* ENET_PPS_OUT */
#define ENET_PPS_OUT_PB5 \
	GD32_PINMUX_AF('B', 5, AF11)

/* ENET_RMII_CRS_DV */
#define ENET_RMII_CRS_DV_PA7 \
	GD32_PINMUX_AF('A', 7, AF11)

/* ENET_RMII_REF_CLK */
#define ENET_RMII_REF_CLK_PA1 \
	GD32_PINMUX_AF('A', 1, AF11)

/* ENET_RMII_RXD0 */
#define ENET_RMII_RXD0_PC4 \
	GD32_PINMUX_AF('C', 4, AF11)

/* ENET_RMII_RXD1 */
#define ENET_RMII_RXD1_PC5 \
	GD32_PINMUX_AF('C', 5, AF11)

/* ENET_RMII_TXD0 */
#define ENET_RMII_TXD0_PB11 \
	GD32_PINMUX_AF('B', 11, AF11)

/* ENET_RMII_TXD1 */
#define ENET_RMII_TXD1_PB12 \
	GD32_PINMUX_AF('B', 12, AF11)

/* ENET_RMII_TX_EN */
#define ENET_RMII_TX_EN_PB10 \
	GD32_PINMUX_AF('B', 10, AF11)

/* EVENTOUT */
#define EVENTOUT_PA0 \
	GD32_PINMUX_AF('A', 0, AF15)
#define EVENTOUT_PA1 \
	GD32_PINMUX_AF('A', 1, AF15)
#define EVENTOUT_PA2 \
	GD32_PINMUX_AF('A', 2, AF15)
#define EVENTOUT_PA3 \
	GD32_PINMUX_AF('A', 3, AF15)
#define EVENTOUT_PA4 \
	GD32_PINMUX_AF('A', 4, AF15)
#define EVENTOUT_PA5 \
	GD32_PINMUX_AF('A', 5, AF15)
#define EVENTOUT_PA6 \
	GD32_PINMUX_AF('A', 6, AF15)
#define EVENTOUT_PA7 \
	GD32_PINMUX_AF('A', 7, AF15)
#define EVENTOUT_PA8 \
	GD32_PINMUX_AF('A', 8, AF15)
#define EVENTOUT_PA9 \
	GD32_PINMUX_AF('A', 9, AF15)
#define EVENTOUT_PA10 \
	GD32_PINMUX_AF('A', 10, AF15)
#define EVENTOUT_PA11 \
	GD32_PINMUX_AF('A', 11, AF15)
#define EVENTOUT_PA12 \
	GD32_PINMUX_AF('A', 12, AF15)
#define EVENTOUT_PA13 \
	GD32_PINMUX_AF('A', 13, AF15)
#define EVENTOUT_PA14 \
	GD32_PINMUX_AF('A', 14, AF15)
#define EVENTOUT_PA15 \
	GD32_PINMUX_AF('A', 15, AF15)
#define EVENTOUT_PB0 \
	GD32_PINMUX_AF('B', 0, AF15)
#define EVENTOUT_PB1 \
	GD32_PINMUX_AF('B', 1, AF15)
#define EVENTOUT_PB2 \
	GD32_PINMUX_AF('B', 2, AF15)
#define EVENTOUT_PB3 \
	GD32_PINMUX_AF('B', 3, AF15)
#define EVENTOUT_PB4 \
	GD32_PINMUX_AF('B', 4, AF15)
#define EVENTOUT_PB5 \
	GD32_PINMUX_AF('B', 5, AF15)
#define EVENTOUT_PB6 \
	GD32_PINMUX_AF('B', 6, AF15)
#define EVENTOUT_PB7 \
	GD32_PINMUX_AF('B', 7, AF15)
#define EVENTOUT_PB8 \
	GD32_PINMUX_AF('B', 8, AF15)
#define EVENTOUT_PB9 \
	GD32_PINMUX_AF('B', 9, AF15)
#define EVENTOUT_PB10 \
	GD32_PINMUX_AF('B', 10, AF15)
#define EVENTOUT_PB11 \
	GD32_PINMUX_AF('B', 11, AF15)
#define EVENTOUT_PB12 \
	GD32_PINMUX_AF('B', 12, AF15)
#define EVENTOUT_PB13 \
	GD32_PINMUX_AF('B', 13, AF15)
#define EVENTOUT_PB14 \
	GD32_PINMUX_AF('B', 14, AF15)
#define EVENTOUT_PB15 \
	GD32_PINMUX_AF('B', 15, AF15)
#define EVENTOUT_PC0 \
	GD32_PINMUX_AF('C', 0, AF15)
#define EVENTOUT_PC1 \
	GD32_PINMUX_AF('C', 1, AF15)
#define EVENTOUT_PC2 \
	GD32_PINMUX_AF('C', 2, AF15)
#define EVENTOUT_PC3 \
	GD32_PINMUX_AF('C', 3, AF15)
#define EVENTOUT_PC4 \
	GD32_PINMUX_AF('C', 4, AF15)
#define EVENTOUT_PC5 \
	GD32_PINMUX_AF('C', 5, AF15)
#define EVENTOUT_PC6 \
	GD32_PINMUX_AF('C', 6, AF15)
#define EVENTOUT_PC7 \
	GD32_PINMUX_AF('C', 7, AF15)
#define EVENTOUT_PC8 \
	GD32_PINMUX_AF('C', 8, AF15)
#define EVENTOUT_PC9 \
	GD32_PINMUX_AF('C', 9, AF15)
#define EVENTOUT_PC10 \
	GD32_PINMUX_AF('C', 10, AF15)
#define EVENTOUT_PC11 \
	GD32_PINMUX_AF('C', 11, AF15)
#define EVENTOUT_PC12 \
	GD32_PINMUX_AF('C', 12, AF15)
#define EVENTOUT_PC13 \
	GD32_PINMUX_AF('C', 13, AF15)
#define EVENTOUT_PC14 \
	GD32_PINMUX_AF('C', 14, AF15)
#define EVENTOUT_PC15 \
	GD32_PINMUX_AF('C', 15, AF15)
#define EVENTOUT_PD0 \
	GD32_PINMUX_AF('D', 0, AF15)
#define EVENTOUT_PD1 \
	GD32_PINMUX_AF('D', 1, AF15)
#define EVENTOUT_PD2 \
	GD32_PINMUX_AF('D', 2, AF15)
#define EVENTOUT_PD3 \
	GD32_PINMUX_AF('D', 3, AF15)
#define EVENTOUT_PD4 \
	GD32_PINMUX_AF('D', 4, AF15)
#define EVENTOUT_PD5 \
	GD32_PINMUX_AF('D', 5, AF15)
#define EVENTOUT_PD6 \
	GD32_PINMUX_AF('D', 6, AF15)
#define EVENTOUT_PD7 \
	GD32_PINMUX_AF('D', 7, AF15)
#define EVENTOUT_PD8 \
	GD32_PINMUX_AF('D', 8, AF15)
#define EVENTOUT_PD9 \
	GD32_PINMUX_AF('D', 9, AF15)
#define EVENTOUT_PD10 \
	GD32_PINMUX_AF('D', 10, AF15)
#define EVENTOUT_PD11 \
	GD32_PINMUX_AF('D', 11, AF15)
#define EVENTOUT_PD12 \
	GD32_PINMUX_AF('D', 12, AF15)
#define EVENTOUT_PD13 \
	GD32_PINMUX_AF('D', 13, AF15)
#define EVENTOUT_PD14 \
	GD32_PINMUX_AF('D', 14, AF15)
#define EVENTOUT_PD15 \
	GD32_PINMUX_AF('D', 15, AF15)
#define EVENTOUT_PE0 \
	GD32_PINMUX_AF('E', 0, AF15)
#define EVENTOUT_PE1 \
	GD32_PINMUX_AF('E', 1, AF15)
#define EVENTOUT_PE2 \
	GD32_PINMUX_AF('E', 2, AF15)
#define EVENTOUT_PE3 \
	GD32_PINMUX_AF('E', 3, AF15)
#define EVENTOUT_PE4 \
	GD32_PINMUX_AF('E', 4, AF15)
#define EVENTOUT_PE5 \
	GD32_PINMUX_AF('E', 5, AF15)
#define EVENTOUT_PE6 \
	GD32_PINMUX_AF('E', 6, AF15)
#define EVENTOUT_PE7 \
	GD32_PINMUX_AF('E', 7, AF15)
#define EVENTOUT_PE8 \
	GD32_PINMUX_AF('E', 8, AF15)
#define EVENTOUT_PE9 \
	GD32_PINMUX_AF('E', 9, AF15)
#define EVENTOUT_PE10 \
	GD32_PINMUX_AF('E', 10, AF15)
#define EVENTOUT_PE11 \
	GD32_PINMUX_AF('E', 11, AF15)
#define EVENTOUT_PE12 \
	GD32_PINMUX_AF('E', 12, AF15)
#define EVENTOUT_PE13 \
	GD32_PINMUX_AF('E', 13, AF15)
#define EVENTOUT_PE14 \
	GD32_PINMUX_AF('E', 14, AF15)
#define EVENTOUT_PE15 \
	GD32_PINMUX_AF('E', 15, AF15)
#define EVENTOUT_PF0 \
	GD32_PINMUX_AF('F', 0, AF15)
#define EVENTOUT_PF1 \
	GD32_PINMUX_AF('F', 1, AF15)
#define EVENTOUT_PF2 \
	GD32_PINMUX_AF('F', 2, AF15)
#define EVENTOUT_PF3 \
	GD32_PINMUX_AF('F', 3, AF15)
#define EVENTOUT_PF4 \
	GD32_PINMUX_AF('F', 4, AF15)
#define EVENTOUT_PF5 \
	GD32_PINMUX_AF('F', 5, AF15)
#define EVENTOUT_PF6 \
	GD32_PINMUX_AF('F', 6, AF15)
#define EVENTOUT_PF7 \
	GD32_PINMUX_AF('F', 7, AF15)
#define EVENTOUT_PF8 \
	GD32_PINMUX_AF('F', 8, AF15)
#define EVENTOUT_PF9 \
	GD32_PINMUX_AF('F', 9, AF15)
#define EVENTOUT_PF10 \
	GD32_PINMUX_AF('F', 10, AF15)
#define EVENTOUT_PF11 \
	GD32_PINMUX_AF('F', 11, AF15)
#define EVENTOUT_PF12 \
	GD32_PINMUX_AF('F', 12, AF15)
#define EVENTOUT_PF13 \
	GD32_PINMUX_AF('F', 13, AF15)
#define EVENTOUT_PF14 \
	GD32_PINMUX_AF('F', 14, AF15)
#define EVENTOUT_PF15 \
	GD32_PINMUX_AF('F', 15, AF15)
#define EVENTOUT_PG0 \
	GD32_PINMUX_AF('G', 0, AF15)
#define EVENTOUT_PG1 \
	GD32_PINMUX_AF('G', 1, AF15)
#define EVENTOUT_PG2 \
	GD32_PINMUX_AF('G', 2, AF15)
#define EVENTOUT_PG3 \
	GD32_PINMUX_AF('G', 3, AF15)
#define EVENTOUT_PG4 \
	GD32_PINMUX_AF('G', 4, AF15)
#define EVENTOUT_PG5 \
	GD32_PINMUX_AF('G', 5, AF15)
#define EVENTOUT_PG6 \
	GD32_PINMUX_AF('G', 6, AF15)
#define EVENTOUT_PG7 \
	GD32_PINMUX_AF('G', 7, AF15)
#define EVENTOUT_PG8 \
	GD32_PINMUX_AF('G', 8, AF15)
#define EVENTOUT_PG9 \
	GD32_PINMUX_AF('G', 9, AF15)
#define EVENTOUT_PG10 \
	GD32_PINMUX_AF('G', 10, AF15)
#define EVENTOUT_PG11 \
	GD32_PINMUX_AF('G', 11, AF15)
#define EVENTOUT_PG12 \
	GD32_PINMUX_AF('G', 12, AF15)
#define EVENTOUT_PG13 \
	GD32_PINMUX_AF('G', 13, AF15)
#define EVENTOUT_PG14 \
	GD32_PINMUX_AF('G', 14, AF15)
#define EVENTOUT_PG15 \
	GD32_PINMUX_AF('G', 15, AF15)

/* EXMC_A0 */
#define EXMC_A0_PF0 \
	GD32_PINMUX_AF('F', 0, AF12)

